import { Checkbox } from "@/components/ui/checkbox";
import { Label } from "@/components/ui/label";

interface CheckboxQuestionProps {
  index: number;
  value: number[];
  onChange: (value: number[], itemId: string, selectedLabels: string[]) => void;
}

const CheckboxQuestion = ({ index, value = [], onChange }: CheckboxQuestionProps) => {
  const questionList = [
    [
      { id: "1", label: "สมมุติฐานมีทฤษฎีทางวิทยาศาสตร์หรือคณิตศาสตร์รองรับ" },
      { id: "2", label: "สมมุติฐานเป็นไปตามงานวิจัยที่เกี่ยวข้อง" },
      { id: "3", label: "ผู้วิจัยมีการพัฒนาแนวคิดหรือสมการเพื่อสนับสนุนสมมุติฐาน" },
    ],
    [
      { id: "1", label: "สมมุติฐานผ่านการตรวจสอบโดยผู้เชี่ยวชาญ และยืนยันหลักการทางวิทยาศาสตร์พื้นฐาน" },
      { id: "2", label: "สมมุติฐานแสดงแนวทางที่เป็นไปได้พร้อม ระบุส่วนประกอบสำคัญของเทคโนโลยี" },
      { id: "3", label: "สมมุติฐานมีการประเมินหรือคาดการณ์ประสิทธิภาพเบื้องต้นขององค์ประกอบหลัก" },
      { id: "4", label: "มีการศึกษาเบื้องต้นยืนยันความเป็นไปได้ของการจำลอง กระบวนการอย่างง่าย (การศึกษาโดยไม่มีการทดลองในห้องปฏิบัติการ" },
      { id: "5", label: "สมมุติฐานมีการทดสอบแนวคิด (Proof of Concept) ด้วยข้อมูลสังเคราะห์" },
    ],
    [
      { id: "1", label: "สมมุติฐานถูกพิสูจน์ด้วยการทดลองเบื้องต้นแล้ว" },
      { id: "2", label: "การทดลองสามารถคาดการณ์ของส่วนประกอบเทคโนโลยีได้" },
      { id: "3", label: "มีการสร้างตัวชี้วัดประสิทธิภาพเทคโนโลยีหรือระบบ" },
      { id: "4", label: "มีข้อเท็จจริงวิทยาศาสตร์ที่เกี่ยวข้องกับการพัฒนาเทคโนโลยีที่สามารถจำลองทำซ้ำได้" },
      { id: "5", label: "มีการยืนยันคุณสมบัติและประสิทธิภาพของเทคโนโลยีหรือระบบด้วยสมการ หรือตัวแปร" },
      { id: "6", label: "มีหลักฐานงานวิจัยที่เผยแพร่แล้วว่าการรวมเทคโนโลยีและส่วนประกอบของระบบประสบความสำเร็จ" },
      { id: "7", label: "มีการระบุความเสี่ยงและมีการบริหารความเสี่ยงสำหรับงานวิจัย" },
    ],
    [
      { id: "1", label: "มีการสรุปและจัดทำข้อกำหนดของระบบ/การออกแบบ โดยอ้างอิงจากความต้องการจริง" },
      { id: "2", label: "มีการระบุวัสดุ กระบวนการ และเทคนิคที่เกี่ยวข้อง" },
      { id: "3", label: "มีต้นแบบเทคโนโลยีที่ปรับขนาดได้" },
      { id: "4", label: "มีการทดสอบและแสดงประสิทธิภาพของส่วนประกอบและต้นแบบในห้องปฏิบัติการ" },
      { id: "5", label: "มีการจำลองและตรวจสอบความเป็นไปได้ของกระบวนการ" },
      { id: "6", label: "มีส่วนประกอบของระบบครบถ้วนและเพียงพอ" },
      { id: "7", label: "มีการเริ่มศึกษาบูรณาการกับการใช้งานอื่น" },
      { id: "8", label: "มีการระบุปัจจัยต้นทุน" },
      { id: "9", label: "มีการริเริ่มโปรแกรมการจัดการความเสี่ยงอย่างเป็นทางการและบูรณาการกับการจัดการโครงการ" },
    ],
    [
      { id: "1", label: "ต้นแบบถูกพัฒนาและทำงานได้จริง โดยมีการรวมโมดูล/ฟังก์ชันสำคัญ และทดสอบการทำงานภายใต้สภาวะที่ใกล้เคียงหรือเป็นจริง" },
      { id: "2", label: "ส่วนประกอบและส่วนต่อประสานของระบบได้รับการกำหนด ตรวจสอบ และรับรองตามมาตรฐานที่ยอมรับได้" },
      { id: "3", label: "มีการวัดผลกระบวนการที่เที่ยงตรง" },
      { id: "4", label: "มีการระบุปัญหาและประเมินความน่าเชื่อถือด้านคุณภาพ" },
      { id: "5", label: "มีการสรุปกระบวนการออกแบบสำหรับการใช้งานจริง" },
      { id: "6", label: "มีการจัดทำและดำเนินการตามแผนบริหารความเสี่ยง" },
    ],
    [
      { id: "1", label: "มีการทดสอบและสาธิตต้นแบบในสภาพแวดล้อมที่เกี่ยวข้อง/จำลองจริง พร้อมการยืนยันคุณสมบัติทางวิศวกรรมและประสิทธิภาพของระบบ" },
      { id: "2", label: "ส่วนประกอบของสินค้าหรือบริการต้นแบบนั้นสามารถทำงานร่วมกันได้ในการทดสอบการแก้ปัญหาจริง" },
      { id: "3", label: "มีการจัดเตรียมวัสดุ/อุปกรณ์ภายนอกครบถ้วน" },
      { id: "4", label: "มีการรวบรวมข้อมูลด้านการบำรุงรักษาและระบบสนับสนุนที่เชื่อถือได้" },
    ],
    [
      { id: "1", label: "มีการทดสอบและตรวจสอบการปฏิบัติงานของอุปกรณ์/กระบวนการในสภาวะจริง เพื่อหาข้อจำกัด จุดบกพร่อง และยืนยันความถูกต้องกับระบบที่ใช้งานอยู่" },
      { id: "2", label: "มีต้นแบบและส่วนประกอบที่ใกล้เคียงของจริง แสดงให้เห็นถึงความพอดีและฟังก์ชันการทำงานที่สอดคล้องกับการผลิตจริง" },
      { id: "3", label: "มีข้อมูลสนับสนุนด้านความน่าเชื่อถือ การบำรุงรักษา" },
      { id: "4", label: "มีอุปกรณ์และวัสดุที่ใช้ได้จริงในกระบวนการผลิต" },
    ],
    [
      { id: "1", label: "ทุกองค์ประกอบของเทคโนโลยี/ระบบมีความพอดี ฟังก์ชันเข้ากันได้ และเหมาะสมกับสภาพแวดล้อมการทำงานจริง" },
      { id: "2", label: "วัสดุทั้งหมดในการผลิตและพร้อมใช้งาน" },
      { id: "3", label: "มีข้อมูลและเอกสารการบำรุงรักษา/การสนับสนุนที่สมบูรณ์และอยู่ภายใต้การควบคุมการกำหนดค่า" },
    ],
    [
      { id: "1", label: "เทคโนโลยี/ระบบทำงานได้ตามที่กำหนดในเอกสารแนวคิด มีการนำไปปรับใช้ในสภาพแวดล้อมจริง และแสดงศักยภาพได้อย่างสมบูรณ์" },
      { id: "2", label: "มีการทดสอบและประเมินผลการปฏิบัติงานสำเร็จแล้วและจัดทำเป็นเอกสาร" },
      { id: "3", label: "มีการออกแบบโดยคำนึงถึงเป้าหมายด้านต้นทุน" },
      { id: "4", label: "มีการระบุและบรรเทาความเสี่ยงด้านความปลอดภัยและผลข้างเคียง" },
    ]
  ];

  const selectedQuestions = questionList[index - 1];

  const itemId = `cq${index}`;

  const handleCheckboxChange = (checked: boolean, id: string) => {
    const index = Number(id) - 1;
    const updatedValue = [...value];

    updatedValue[index] = checked ? 1 : 0;

    const selectedLabels = selectedQuestions
        .filter((_, idx) => updatedValue[idx] === 1)
        .map(item => item.label);

    onChange(updatedValue, itemId, selectedLabels);
  };

  return (
    <div>
      <h3 className="font-semibold text-primary">Research ของคุณตรงตามข้อใดบ้าง</h3>
      <div className="grid grid-cols-1 md:grid-cols gap-2 mt-2">
        {selectedQuestions.map((item) => (
          <div key={item.id} className="flex items-center space-x-2">
            <Checkbox
              id={item.id}
              checked={value[Number(item.id) - 1] === 1}
              onCheckedChange={(checked: boolean) => handleCheckboxChange(checked, item.id)}
            />
            <Label htmlFor={item.id}>{item.label}</Label>
          </div>
        ))}
      </div>
    </div>
  );
};

export default CheckboxQuestion;
